Tekla.Structures.Internal.Plugins
Plugins data

Tekla.Structures.Internal.Plugins.pluginManager
Plugin Manager, there's only one instance

Tekla.Structures.Internal.Plugins.pluginStack
Stack of plugins (in case of nested plugins)

Tekla.Structures.Internal.Plugins.currentHelper
Current plugin instance wrapper

Tekla.Structures.Internal.Plugins.useDefaultAppDomain
The use default application domain

Tekla.Structures.Internal.Plugins.loadedPluginAssemblies
Plugin assemblies loaded to default appdomain in Assembly.LoadFrom() context.
Used only if UseDefaultAppDomain is true.

Tekla.Structures.Internal.Plugins.loadedPluginAssemblyNames
Plugin assembly names loaded to default appdomain in Assembly.LoadFrom() context.
Used only if UseDefaultAppDomain is true.

Tekla.Structures.Internal.Plugins.LoadPluginAssembly(System.String)
Loads the plugin assembly from the disc or returns it from memory if it's already been loaded.
pluginAssemblyLocation: The plugin assembly location.
Returns: returns assembly

Tekla.Structures.Internal.Plugins.GetPluginFormFullName(System.String,System.String@)
Gets the complete name of the PluginForm of the Plugin.
pluginName: Name of the plugin.
pluginFormFullName: Complete name of the plugins form, null if it does not have one.
Returns: true if the name has been found, otherwise false

Tekla.Structures.Internal.Plugins.GetPluginNameFromFormFullName(System.String,System.String@)
Gets the complete name of the PluginForm of the Plugin.
pluginName: Name of the plugin.
pluginFormFullName: Complete name of the plugins form, null if it does not have one.
Returns: true if the name has been found, otherwise false

Tekla.Structures.Internal.Plugins.GetPluginBaseDirectory
Retrieves the path to the Plugin folder which resides beneath TeklaStructures folder.
Returns: The complete path or empty string if no plugin path existed.

Tekla.Structures.Internal.Plugins.GetExtensionsDirectories
Retrieves the path to the Extensions folder which resides in defined extension folder.
Returns: The complete path or empty string if no extensions path existed.

Tekla.Structures.Internal.Plugins.GetDefaultExtensionsFolder
Retrieves the default path to the extensions.
Returns: The complete path or empty string if no extensions path existed.

Tekla.Structures.Internal.Plugins.IsDrawingPlugin(System.String)
Checks if the plugin defined by the given PluginName is a drawing plugin or not.
pluginName: The name of the plugin.
Returns: True if the plugin is a drawing plugin otherwise false

Tekla.Structures.Internal.Plugins.IsConnectionPlugin(System.String)
Checks if the plugin defined by the given PluginName is a connection plugin or not.
pluginName: The name of the plugin.
Returns: True if the plugin is a connection plugin otherwise false

Tekla.Structures.Internal.Plugins.GetAssemblyNameToLoad(System.String)
Gets the assembly name to load.

Tekla.Structures.Internal.Plugins.LoadPlugins
Loads the plugins.

Tekla.Structures.Internal.Plugins.ReadPlugins
Reads the plugins.

Tekla.Structures.Internal.Plugins.SearchForTpackExtensions(System.String)
Requests TPack system for TeklaPlugin type of dlls

Tekla.Structures.Internal.Plugins.SearchForPlugins(System.String,System.String)
Scan for Plugins
xsbin: the xsbin path
pluginBaseDirectory: The base directory for plugins

Tekla.Structures.Internal.Plugins.SearchForExtensions(System.String,System.String)
Scan for Extensions
xsbin: the xsbin path
pluginBaseDirectory: The base directory for plugins

Tekla.Structures.Internal.Plugins.GetStructuresPluginDescriptor(System.String)
Gets the structures plugin descriptor.
PluginName: Name of the plugin.
Returns: plugin descripto

Tekla.Structures.Internal.Plugins.InstantiatePlugin(System.String,System.Object@,Tekla.Structures.Internal.ITsInvoker@,Tekla.Structures.Internal.Plugins.CreateInvokerDelegate)
Instantiates the plugin.
PluginName: Name of the plugin.
plugin: The plugin.
Invoker: TS Invoker.
CreateInvoker: CreateInvoker Delagate
Returns: ok or not

Tekla.Structures.Internal.Plugins.InstantiateAndSetAsCurrentPlugin(System.String,Tekla.Structures.Internal.Plugins.CreateInvokerDelegate)
Instantiates the and set as current plugin.
PluginName: Name of the plugin.
CreateInvoker:  CreateInvoker dalegate
Returns: ok or no

Tekla.Structures.Internal.Plugins.CancelCurrentPlugin
Cancels the current plugin.
Returns: 1 if ok

Tekla.Structures.Internal.Plugins.InitializePluginManager
Initializes the plugin manager.

Tekla.Structures.Internal.Plugins.ResetCurrentPlugin
Resets Current plugin

Tekla.Structures.Internal.Plugins.RunCurrent
Runs the currently set plugin
Returns: success/failure

Tekla.Structures.Internal.Plugins.DefinePluginInput(System.Boolean)
Define plugin input
Returns: success/failure

Tekla.Structures.Internal.Plugins.Run(System.String)
Runs the specified parameter.
param: The parameter.
Returns: return result